KCH_TEXTS = {
1: "Самонадеянность, нежелание учиться и осваивать новое. Некорректное отношение к учителям и наставникам. Зависть к тем, кто знает больше.",

2: "Зависть, неуважение к женщинам, обидчивость, капризность. Раздражают чужие слабости.",

3: "Нежелание иметь детей, жадность, чувство собственности. Нежелание слушать советы матери и учитывать мнение детей.",

4: "Холодность, жесткость, грубый подход к людям. Зацикленность на карьере и материальных благах. Желание жить за чужой счет.",

5: "Грубость и хамство. Неуважение к мужчинам, мудрости старших и начальникам. Эгоизм и высокомерие.",

6: "Непостоянство, склонность к изменам и сомнениям. Нежелание идти на компромисс. Жертвование своими интересами ради партнера.",

7: "Лень, нежелание развиваться и двигаться вперед. Попытка реализовывать свои идеи чужими руками. Коварство и хитрость.",

8: "Игнорирование правил и законов. Мстительность, конфликтность. Навязывание окружающим собственных правил.",

9: "Страх критических ситуаций. Склонность к одиночеству. Позиция жертвы. Страх боли и болезней.",

10: "Меркантильность, корысть, финансовая нечистоплотность. Склонность не отдавать долги.",

11: "Ершистость, драчливость, неумение контролировать эмоции. Нападение при ощущении опасности. Страх поражения.",

12: "Хамство, наглость, отсутствие сочувствия. Неблагодарность. Склонность к депрессии и зависимостям.",

13: "Аффективное поведение, жестокость. Неумение ценить здоровье. Склонность к эгоизму, хитрости и мстительности.",

14: "Жадность, потребительство. Уверенность, что все должны. Склонность к шантажу и использованию людей.",

15: "Шантаж, мстительность. Резкие перепады настроения. Склонность к изменам и фантазиям.",

16: "Самодурство, домострой, категоричность. Не идут на компромисс. В семье могут проявлять тиранию.",

17: "Идейность без действий. Склонность подталкивать других делать то, что не делают сами. Присвоение чужих заслуг.",

18: "Лживость, позерство, жизнь в иллюзиях. Переворачивание фактов и перекладывание ответственности.",

19: "Властность и желание все контролировать. Склонность к манипулированию людьми.",

20: "Отрицание своего рода и традиций. Брезгливость. Неуважение к предкам. Присвоение чужих заслуг рода.",

21: "Склонность считать себя самым крутым. Любовь к роскоши, брендам и стремление пробиться в высшие круги любой ценой.",

22: "Склонность играть роль наивного человека. Хитрость и коварство. Перекладывание вины и ответственности на других."


}
